#ifndef __12864_H
#define __12864_H

#include <msp430.h>
#include "system.h"
#include "type.h"

#define DATAPORT		P5OUT                   //数据口所在端口P4
#define DATASEL         P5SEL                   //数据口功能寄存器，控制功能模式
#define DATADIR         P5DIR                   //数据口方向寄存器

#define RS_CLR	        P4OUT &= ~BIT4           //RS置低
#define RS_SET	        P4OUT |=  BIT4           //RS置高

#define RW_CLR	        P4OUT &= ~BIT5           //RW置低
#define RW_SET	        P4OUT |=  BIT5           //RW置高

#define EN_CLR	        P4OUT &= ~BIT6           //E置低
#define EN_SET	        P4OUT |=  BIT6           //E置高

#define RST_CLR	        P4OUT &= ~BIT7            //RST置低
#define RST_SET	        P4OUT |=  BIT7            //RST置高

/*12864应用指令*/
#define CLEAR_SCREEN	0x01		          //清屏指令：清屏且AC值为00H
#define AC_INIT			0x02		          //将AC设置为00H。且游标移到原点位置
#define CURSE_ADD		0x06		          //设定游标移到方向及图像整体移动方向（默认游标右移，图像整体不动）
#define FUN_MODE		0x30		          //工作模式：8位基本指令集
#define FUN_MODEK		0x36		          //工作模式：8位扩展指令集
#define DISPLAY_ON		0x0c		          //显示开,显示游标，且游标位置反白
#define DISPLAY_OFF		0x08		          //显示关
#define CURSE_DIR		0x14		          //游标向右移动:AC=AC+1
#define SET_CG_AC		0x40		          //设置AC，范围为：00H~3FH
#define SET_DD_AC		0x80                  //设置DDRAM AC

#define X1address       0x80        //12864上半屏X轴起始地址
#define X2address       0x88        //12864下半屏X轴起始地址
#define Yaddress        0x80        //Y轴起始地址

#define firstcode		0x80		//第一行起始地址
#define secondcode		0x90		//第二行起始地址
#define thirdcode		0x88		//第三行起始地址
#define fourthcode		0x98		//第四行起始地址

/****************************************************************************
* 名    称：LCD_Port_Init
* 功    能：LCD端口初始化
* 入口参数：无
* 出口参数：无
****************************************************************************/
void LCD_Port_Init(void);

/****************************************************************************
* 名    称：LCD_Init
* 功    能：LCD硬件初始化
* 入口参数：无
* 出口参数：无
****************************************************************************/
void LCD_Init(void);
 
/****************************************************************************
* 名    称：LCD_Write_Com
* 功    能：LCD命令写入
* 入口参数：com--控制命令
* 出口参数：无
****************************************************************************/
void LCD_Write_Com(uchar com);
 
/****************************************************************************
* 名    称：LCD_Write_Data
* 功    能：LCD数据写入
* 入口参数：data--显示数据
* 出口参数：无
****************************************************************************/
void LCD_Write_Data(uchar data);
 
/****************************************************************************
* 名    称：DisplayCharter
* 功    能：LCD显示汉字或字符
* 入口参数：addr--地址；hz--汉字指针
* 出口参数：无
****************************************************************************/
void DisplayCharter(uchar addr,uchar *hz);

/****************************************************************************
* 名    称：DisplayNumber
* 功    能：LCD显示数字
* 入口参数：addr--地址；number--数字
* 出口参数：无
****************************************************************************/
void DisplayNumber(uchar addr,uint number);

/****************************************************************************
* 名    称：LCD12864_Clear
* 功    能：LCD基本指令清屏
* 入口参数：无
* 出口参数：无
****************************************************************************/
void LCD12864_Clear(void);
 
/****************************************************************************
* 名    称：Display_Photo1
* 功    能：LCD上半部分图片显示
* 入口参数：img1--图片指针或者数组名
* 出口参数：无
****************************************************************************/
void Display_Photo1(const uchar *img1);

/****************************************************************************
* 名    称：Display_Photo2
* 功    能：LCD下半部分图片显示
* 入口参数：img2--图片指针或者数组名
* 出口参数：无
****************************************************************************/
void Display_Photo2(const uchar *img2);
 
/****************************************************************************
* 名    称：LCD_Photo_Clear
* 功    能：LCD扩展指令清屏
* 入口参数：无
* 出口参数：无
****************************************************************************/
void LCD_Photo_Clear(void);

#endif
