#ifndef __KEY_H
#define __KEY_H

#include <msp430.h>
#include "system.h"
#include "type.h"

//y4    y3    y2    y1   x4    x3   x2    x1
//p1.0  p1.1   p1.2  p1.3  p1.4  p1.5  p1.6  p1.7


extern uchar key;

/****************************************************************************
* 名    称：Key_Port_Init
* 功    能：Key端口初始化
* 入口参数：无
* 出口参数：无
****************************************************************************/
void Key_Port_Init(void);

/****************************************************************************
* 名    称：Key_Scan
* 功    能：Key扫描
* 入口参数：无
* 出口参数：key--矩阵键盘位置
****************************************************************************/
uchar Key_Scan(void);

#endif
